Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetDuctSizeSettingIteratorInternal
Returns a DuctSizeSettingIterator to the duct size settings.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctSizeSettings.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator( KeyValuePair(DuctShape::Enum^,DuctSizes^) ) object that can be used to iterate through key-value pairs in the collection.